In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print(df)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [10]:
df.index=pd.date_range('19001010',periods=df.shape[0])

In [11]:
df

             X   Y   Z
1900-10-10  78  84  86
1900-10-11  85  94  97
1900-10-12  96  89  96
1900-10-13  80  83  72
1900-10-14  86  86  83

In [9]:
df.shape

(5, 3)

In [12]:
df.describe()

          X          Y          Z
count   5.0   5.000000   5.000000
mean   85.0  87.200000  86.800000
std     7.0   4.438468  10.281051
min    78.0  83.000000  72.000000
25%    80.0  84.000000  83.000000
50%    85.0  86.000000  86.000000
75%    86.0  89.000000  96.000000
max    96.0  94.000000  97.000000

In [13]:
df.apply(pd.Series.value_counts)

      X    Y    Z
72  NaN  NaN  1.0
78  1.0  NaN  NaN
80  1.0  NaN  NaN
83  NaN  1.0  1.0
84  NaN  1.0  NaN
85  1.0  NaN  NaN
86  1.0  1.0  1.0
89  NaN  1.0  NaN
94  NaN  1.0  NaN
96  1.0  NaN  1.0
97  NaN  NaN  1.0

In [32]:
df.dropna(axis=1,thresh=None)

             X   Y   Z
1900-10-10  78  84  86
1900-10-11  85  94  97
1900-10-12  96  89  96
1900-10-13  80  83  72
1900-10-14  86  86  83

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5 entries, 1900-10-10 to 1900-10-14
Freq: D
Data columns (total 3 columns):
X    5 non-null int64
Y    5 non-null int64
Z    5 non-null int64
dtypes: int64(3)
memory usage: 160.0 bytes

In [65]:
df[X].astype(float)

NameError: name 'X' is not defined

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5 entries, 1900-10-10 to 1900-10-14
Freq: D
Data columns (total 3 columns):
X    5 non-null int64
Y    5 non-null int64
Z    5 non-null int64
dtypes: int64(3)
memory usage: 160.0 bytes

In [50]:
df.replace([78,97],['seven-eight','nine-seven'])

                      X   Y           Z
1900-10-10  seven-eight  84          86
1900-10-11           85  94  nine-seven
1900-10-12           96  89          96
1900-10-13           80  83          72
1900-10-14           86  86          83

In [51]:
df.rename(columns={'X': 'new_X'})

            new_X   Y   Z
1900-10-10     78  84  86
1900-10-11     85  94  97
1900-10-12     96  89  96
1900-10-13     80  83  72
1900-10-14     86  86  83

In [53]:
df.rename(columns=lambda x: x + 's')

            Xs  Ys  Zs
1900-10-10  78  84  86
1900-10-11  85  94  97
1900-10-12  96  89  96
1900-10-13  80  83  72
1900-10-14  86  86  83

In [58]:
df.rename(index=lambda x:x+1)

             X   Y   Z
1900-10-11  78  84  86
1900-10-12  85  94  97
1900-10-13  96  89  96
1900-10-14  80  83  72
1900-10-15  86  86  83

ValueError: No group keys passed!

In [61]:
df

             X   Y   Z
1900-10-10  78  84  86
1900-10-11  85  94  97
1900-10-12  96  89  96
1900-10-13  80  83  72
1900-10-14  86  86  83